<template>
  <div>
    <div class="px-3 pt-4">
      <div style="text-align:center;font-size:20px;">贝壳传奇商户端注册协议</div>
      <p style="font-size:16px;">郑重提示</p>

      <p style="font-size:14px;">
        &emsp;&emsp;您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。如您对协议有任何疑问，可向贝壳传奇客服咨询。
        &emsp;&emsp;当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与贝壳传奇达成一致，成为贝壳传奇平台“用户”。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
      </p>

      <p style="font-size:16px;">一、定义</p>
      <p style="font-size:14px;">
        贝壳传奇平台：指包括但不限于贝壳传奇商户通。<br>
        贝壳传奇：贝壳传奇平台经营者的单称或合称，包括深圳万众互联电子商务有限公司等。<br>
        贝壳传奇平台服务：贝壳传奇基于互联网，以包含贝壳传奇平台网站等在内的各种形态（包括未来技术发展出现的新的服务形态）向您提供的各项服务。<br>
        贝壳传奇规则：包括《贝壳传奇商户通规则》等在内所有贝壳传奇已经发布及后续发布的全部规则、解读、公告等内容。<br>
        同一用户：使用同一身份认证信息或经贝壳传奇排查认定多个贝壳传奇账户的实际控制人为同一人的，均视为同一用户。<br>
      </p>

      <p style="font-size:16px;">二、协议范围</p>
      <p style="font-size:14px;">
        （一）签约主体
        &emsp;&emsp;本协议由您与贝壳传奇平台经营者共同缔结，本协议对您与贝壳传奇平台经营者均具有合同效力。
        &emsp;&emsp;贝壳传奇平台经营者是指经营贝壳传奇平台的各法律主体，您可随时查看贝壳传奇平台各网站首页底部公示的证照信息以确定与您履约的贝壳传奇主体。本协议项下，贝壳传奇平台经营者可能根据贝壳传奇平台的业务调整而发生变更，变更后的贝壳传奇平台经营者与您共同履行本协议并向您提供服务，贝壳传奇平台经营者的变更不会影响您本协议项下的权益。贝壳传奇平台经营者还有可能因为提供新的贝壳传奇平台服务而新增，如您使用新增的贝壳传奇平台服务的，视为您同意新增的贝壳传奇平台经营者与您共同履行本协议。发生争议时，您可根据您具体使用的服务及对您权益产生影响的具体行为对象确定与您履约的主体及争议相对方。<br>
        （二）补充协议
        &emsp;&emsp;由于互联网及电子商务的高速发展，您与贝壳传奇签署的本协议列明的条款并不能完整罗列并覆盖您与贝壳传奇所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，《贝壳传奇平台法律声明及隐私权政策》、《贝壳传奇规则》及所有贝壳传奇已经发布的或将来可能发布的各类规则均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用贝壳传奇平台服务，视为您同意上述补充协议。<br>
      </p>

      <p style="font-size:16px;">三、 账户注册与使用</p>
      <p style="font-size:14px;">
        （一）用户资格
        &emsp;&emsp;您确认，在您开始注册程序使用贝壳传奇平台服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。<br>
        （二）账户说明
        &emsp;&emsp;当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得贝壳传奇平台账户并成为贝壳传奇平台用户。
        &emsp;&emsp;您有权使用您设置或确认的贝壳传奇会员名、邮箱、手机号码（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）登录贝壳传奇平台。
        &emsp;&emsp;由于用户账户关联用户信用信息，仅当有法律明文规定、司法裁定或经贝壳传奇同意，并符合贝壳传奇规则规定的用户账户转让流程的情况下，您可进行账户的转让。您的账户一经转让，该账户项下权利义务一并转移。除此外，您的账户不得以任何方式转让，否则由此产生的一切责任均由您承担。
        &emsp;&emsp;如您的账户同时符合以下条件，则贝壳传奇可回收您的账户，您的账户将不能再登录贝壳传奇平台，相应服务同时终止：
        1）连续六个月未用于登录贝壳传奇平台；
        2）不存在未到期的有效业务。<br>
        （三）注册信息管理
        1、真实合法
        &emsp;&emsp;在使用贝壳传奇平台服务时，您应当按贝壳传奇平台页面的提示准确完整地提供您的信息（包括您的姓名及电子邮件地址、联系电话、联系地址等），以便贝壳传奇或其他用户与您联系。您了解并同意，您有义务保持您提供信息的真实性及有效性。
        &emsp;&emsp;您设置的贝壳传奇会员名不得违反国家法律法规及贝壳传奇网规则关于会员名的管理规定，否则贝壳传奇可回收您的贝壳传奇会员名。贝壳传奇会员名的回收不影响您以邮箱、手机号码登录贝壳传奇平台并使用贝壳传奇平台服务。
        2、更新维护
        &emsp;&emsp;您应当及时更新您提供的信息，在法律有明确规定要求贝壳传奇作为平台服务提供者必须对部分用户（如平台卖家等）的信息进行核实的情况下，贝壳传奇将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整的信息。
        &emsp;&emsp;如贝壳传奇按您最后一次提供的信息与您联系未果、您未按贝壳传奇的要求及时提供信息、您提供的信息存在明显不实的，您将承担因此对您自身、他人及贝壳传奇造成的全部损失与不利后果。<br>
        （四）账户安全规范
        &emsp;&emsp;您的账户为您自行设置并由您保管，贝壳传奇任何时候均不会主动要求您提供您的账户。因此，建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开贝壳传奇平台。
        &emsp;&emsp;账户因您主动泄露或遭受他人攻击、诈骗等行为导致的损失及后果，均由您自行承担。
        &emsp;&emsp;除贝壳传奇存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、购买商品及服务及披露信息等）负责。
        &emsp;&emsp;如发现任何未经授权使用您账户登录贝壳传奇平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知贝壳传奇。您理解贝壳传奇对您的任何请求采取行动均需要合理时间，除贝壳传奇存在过错外，贝壳传奇对在采取行动前已经产生的后果不承担任何责任。
      </p>

      <p style="font-size:16px;">四、贝壳传奇平台服务及规范</p>
      <p style="font-size:14px;">
        （一）商品及/或服务的购买与评价
        &emsp;&emsp;当您在贝壳传奇平台购买商品及/或服务时，请您务必仔细确认所购商品的品名、价格、数量、型号、规格、尺寸或服务的时间、内容、限制性要求等重要事项，并在下单时核实您的联系地址、电话、收货人等信息。如您填写的收货人非您本人，则该收货人的行为和意思表示产生的法律后果均由您承担。
        &emsp;&emsp;您的购买行为应当基于真实的消费需求，不得存在对商品及/或服务实施恶意购买、恶意维权等扰乱贝壳传奇平台正常交易秩序的行为。基于维护贝壳传奇平台交易秩序及交易安全的需要，贝壳传奇发现上述情形时可主动执行关闭相关交易订单等操作。
        &emsp;&emsp;您有权在贝壳传奇平台提供的评价系统中对与您达成交易的其他用户商品及/或服务进行评价。
        &emsp;&emsp;您的所有评价行为应遵守贝壳传奇平台规则的相关规定，评价内容应当客观真实，不应包含任何污言秽语、色情低俗、广告信息及法律法规与本协议列明的其他禁止性信息；您不应以不正当方式帮助他人提升信用或利用评价权利对其他用户实施威胁、敲诈勒索。贝壳传奇可按照贝壳传奇规则的相关规定对您实施上述行为所产生的评价信息进行删除或屏蔽。<br>
        （二）礼品兑换须知
        &emsp;&emsp;贝壳传奇兑换平台礼品及/或服务由平台商家免费送出，当您兑换礼品及/或服务时，即表示愿意承担所赠送产品的质量、物流、设计缺陷等产品问题的风险，赠送的产品非消费者直接现金购买所得，故免费获赠产品的会员非产品消费者，并不享受《消费者保护法》7天包退等未列举的义务服务，商家有义务提供有偿售后服务，如商家愿意提供无偿或其他的售后服务，可参考商家提供的服务标准。<br>
        （三）交易争议处理
        &emsp;&emsp;您在贝壳传奇平台交易过程中与其他用户发生争议的，您或其他用户中任何一方均有权选择以下途径解决：
        1）与争议相对方自主协商；
        2）使用贝壳传奇平台提供的争议调处服务；
        3）请求消费者协会或者其他依法成立的调解组织调解；
        4）向有关行政部门投诉；
        5）根据与争议相对方达成的仲裁协议（如有）提请仲裁机构仲裁；
        6）向人民法院提起诉讼。<br>
        &emsp;&emsp;如您选择使用贝壳传奇平台的争议调处服务，则表示您认可贝壳传奇平台的客服作为独立的第三方根据其所了解到的争议事实并依据贝壳传奇平台规则所作出的调处决定（包括调整相关订单的交易状态、判定将争议款项的全部或部分支付给交易一方或双方等）。在贝壳传奇平台调处决定作出前，您可选择其他途径解决争议以中止贝壳传奇平台的争议调处服务。
        &emsp;&emsp;如您对调处决定不满意，您仍有权采取其他争议处理途径解决争议，但通过其他争议处理途径未取得终局决定前，您仍应先履行调处决定。<br>
        （四）费用
        &emsp;&emsp;贝壳传奇为贝壳传奇平台向您提供的服务付出了大量的成本，除贝壳传奇平台明示的收费业务外，贝壳传奇向您提供的服务目前是免费的。如未来贝壳传奇向您收取合理费用，贝壳传奇会采取合理途径并以足够合理的期限提前通过法定程序并以本协议第八条约定的方式通知您，确保您有充分选择的权利。<br>
        （五）责任限制
        &emsp;&emsp;贝壳传奇负责"按现状"和"可得到"的状态向您提供贝壳传奇平台服务。贝壳传奇依法律规定承担基础保障义务，但无法对由于信息网络设备维护、连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或因第三方原因而给您造成的损害结果承担责任。
        &emsp;&emsp;贝壳传奇仅向您提供贝壳传奇平台服务，您了解贝壳传奇平台上的信息系用户自行发布，且可能存在风险和瑕疵。鉴于贝壳传奇平台具备存在海量信息及信息网络环境下信息与实物相分离的特点，贝壳传奇无法逐一审查商品及/或服务的信息，无法逐一审查交易所涉及的商品及/或服务的质量、安全以及合法性、真实性、准确性，对此您应谨慎判断。
        &emsp;&emsp;您理解并同意，在争议调处服务中，贝壳传奇平台的客服并非专业人士，仅能以普通人的认知对用户提交的凭证进行判断。因此，除存在故意外，调处方对争议调处决定免责。
      </p>

      <p style="font-size:16px;">五、用户信息的保护及授权</p>
      <p style="font-size:14px;">
        （一）个人信息的保护
        &emsp;&emsp;贝壳传奇非常重视用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，在您使用贝壳传奇提供的服务时，您同意贝壳传奇按照在贝壳传奇平台上公布的隐私权政策收集、存储、使用、披露和保护您的个人信息。贝壳传奇希望通过隐私权政策向您清楚地介绍贝壳传奇对您个人信息的处理方式，因此贝壳传奇建议您完整地阅读隐私权政策，以帮助您更好地保护您的隐私权。<br>
        （二）非个人信息的保证与授权
        &emsp;&emsp;您声明并保证，您对您所发布的信息拥有相应、合法的权利。否则，贝壳传奇可对您发布的信息依法或依本协议进行删除或屏蔽。
        &emsp;&emsp;您应当确保您所发布的信息不包含以下内容：
        1）违反国家法律法规禁止性规定的；
        2）政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
        3）欺诈、虚假、不准确或存在误导性的；
        4）侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；
        5）侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；
        6）存在可能破坏、篡改、删除、影响贝壳传奇平台任何系统正常运行或未经授权秘密获取贝壳传奇平台及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；
        7）其他违背社会公共利益或公共道德或依据相关贝壳传奇平台协议、规则的规定不适合在贝壳传奇平台上发布的。<br>
        &emsp;&emsp;对于您提供及发布除个人信息外的文字、图片、视频、音频等非个人信息，在版权保护期内您免费授予贝壳传奇及其关联公司获得全球排他的许可使用权利及再授权给其他第三方使用的权利。您同意贝壳传奇及其关联公司存储、使用、复制、修订、编辑、发布、展示、翻译、分发您的非个人信息或制作其派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。
      </p>

      <p style="font-size:16px;">六、 用户的违约及处理</p>
      <p style="font-size:14px;">
        （一）违约认定
        &emsp;&emsp;发生如下情形之一的，视为您违约：
        1）使用贝壳传奇平台服务时违反有关法律法规规定的；
        2）违反本协议或本协议补充协议约定的。<br>
        &emsp;&emsp;为适应电子商务发展和满足海量用户对高效优质服务的需求，您理解并同意，贝壳传奇可在贝壳传奇规则中约定违约认定的程序和标准。如：贝壳传奇可依据您的用户数据与海量用户数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。<br>
        （二）违约处理措施
        &emsp;&emsp;您在贝壳传奇平台上发布的信息构成违约的，贝壳传奇可根据相应规则立即对相应信息进行删除、屏蔽处理。
        &emsp;&emsp;您在贝壳传奇平台上实施的行为，或虽未在贝壳传奇平台上实施但对贝壳传奇平台及其用户产生影响的行为构成违约的，贝壳传奇可依据相应规则对您执行屏蔽账号等处理措施。如您的行为构成根本违约的，贝壳传奇可查封您的账户，终止向您提供服务。
        &emsp;&emsp;贝壳传奇可将对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在贝壳传奇平台上予以公示。<br>
        （三）赔偿责任
        &emsp;&emsp;如您的行为使贝壳传奇及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿贝壳传奇及/或其关联公司的上述全部损失。
        &emsp;&emsp;如您的行为使贝壳传奇及/或其关联公司遭受第三人主张权利，贝壳传奇及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。<br>
        （四）特别约定
        &emsp;&emsp;如您向贝壳传奇及/或其关联公司的雇员或顾问等提供实物、现金、现金等价物、劳务、旅游等价值明显超出正常商务洽谈范畴的利益，则可视为您存在商业贿赂行为。发生上述情形的，贝壳传奇可立即终止与您的所有合作并向您收取赔偿金，该等金额以贝壳传奇因您的贿赂行为而遭受的经济损失和商誉损失作为计算依据。
        &emsp;&emsp;如您因严重违约导致贝壳传奇终止本协议时，出于维护平台秩序的目的，贝壳传奇及/或其关联公司可对与您在其他协议项下的合作采取中止甚或终止协议的措施，并以本协议第八条约定的方式通知您。
        &emsp;&emsp;如贝壳传奇与您签署的其他协议及贝壳传奇及/或其关联公司与您签署的协议中明确约定了对您在本协议项下合作进行关联处理的情形，则贝壳传奇出于维护平台秩序的目的，可在收到指令时中止甚至终止协议，并以本协议第八条约定的方式通知您。<br>
      </p>

      <p style="font-size:16px;">七、 协议的变更</p>
      <p style="font-size:14px;">
        &emsp;&emsp;贝壳传奇可根据国家法律法规变化及维护交易秩序，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过法定程序并以本协议第八条约定的方式通知您。
        &emsp;&emsp;如您不同意变更事项，您有权于变更事项确定的生效日前联系贝壳传奇反馈意见。如反馈意见得以采纳，贝壳传奇将酌情调整变更事项。
        &emsp;&emsp;如您对已生效的变更事项仍不同意的，您应当于变更事项确定的生效之日起停止使用贝壳传奇平台服务，变更事项对您不产生效力；如您在变更事项生效后仍继续使用贝壳传奇平台服务，则视为您同意已生效的变更事项。
      </p>

      <p style="font-size:16px;">八、 通知与送达</p>
      <p style="font-size:14px;">
        &emsp;&emsp;（一）贝壳传奇与您之间的通知往来应以书面形式（传真、电报、电传、电子邮件、站内信息）发送，或以邮资预付的挂号信件、特快专递寄送。以传真、电报、电传或电子邮件发送的，发送当日为送达日，以邮资预付的挂号信件，特快专递寄送的，寄送日后第三日为送达日。
        &emsp;&emsp;二）您联系方式以您注册店铺内的相关信息或资料为准，贝壳传奇的联系方式以贝壳传奇平台公示信息为准。<br>
      </p>

      <div style="text-align:center;font-size:20px;">贝壳传奇法律声明及隐私政策</div>
      <p style="font-size:16px;">郑重提示</p>
      <p
        style="font-size:14px;"

      >&emsp;&emsp;贝壳传奇在此郑重提醒您：在使用贝壳传奇平台各项服务前，请您务必仔细阅读并透彻理解本声明。如对本声明内容有任何疑问，您可向贝壳传奇平台客服咨询了解。阅读本声明的过程中，如果您不同意本声明或其中任何内容，您应立即停止使用贝壳传奇平台服务。同时，为了更为稳妥的保护您的合法权益，贝壳传奇将适时对本声明内容进行优化与完善，并会及时公布更新后的声明文件，届时您如有任何异议或意见，请您立即停止使用贝壳传奇平台服务。一旦您使用或继续使用贝壳传奇平台的服务，则您的使用行为将被视为对本声明全部内容的认可与接受。</p>

      <p style="font-size:16px;">定义</p>
      <p style="font-size:14px;">
        &emsp;&emsp;贝壳传奇平台：指包括贝壳传奇商户通等。
        &emsp;&emsp;贝壳传奇：贝壳传奇平台经营者的单称或合称，包括深圳万众互联电子商务有限公司等。
      </p>

      <p style="font-size:16px;">知识产权声明</p>
      <p style="font-size:14px;">
        一、知识产权归属
        &emsp;&emsp;除非贝壳传奇另行声明，贝壳传奇平台内的所有产品、技术、软件、程序、数据及其他信息（包括但不限于商业模式、文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密等）及相关权利，均归贝壳传奇或其关联公司所有。未经贝壳传奇许可，任何人不得擅自使用（包括但不限于复制、传播、展示、镜像、上载、下载）。
        &emsp;&emsp;贝壳传奇平台的Logo、“贝壳传奇”等文字、图形及其组合，以及贝壳传奇平台的其他标识、徵记、产品和服务名称均为贝壳传奇及其关联公司在中国和其它国家的商标，未经贝壳传奇书面授权，任何人不得以任何方式展示、使用或作其他处理，也不得向他人表明您有权展示、使用或作其他处理。<br>
        二、责任限制
        &emsp;&emsp;鉴于贝壳传奇平台提供的服务属于电子公告牌（BBS）性质，贝壳传奇平台上的店铺、商品信息（包括但不限于店铺名称、公司名称、联系人及联络信息、产品的描述和说明、相关图片、视频等）均由会员自行提供并上传，由会员对其提供并上传的所有信息承担相应法律责任。
        &emsp;&emsp;贝壳传奇平台转载作品出于传递更多信息之目的，并不意味贝壳传奇赞同其观点或已经证实其内容的真实性。<br>
        三、知识产权保护
        &emsp;&emsp;贝壳传奇尊重知识产权，反对任何形式的侵权盗版行为。知识产权权利人认为贝壳传奇平台内容（包括但不限于贝壳传奇平台会员发布的商品信息）可能涉嫌侵犯其合法权益，应当立即通过贝壳传奇客服热线提出通知，贝壳传奇收到后将及时处理。<br>
      </p>

      <p style="font-size:16px;">隐私权政策</p>
      <p style="font-size:14px;">
        &emsp;&emsp;贝壳传奇非常尊重用户个人信息的保护，在您使用贝壳传奇平台提供的服务时，贝壳传奇将按照本隐私权政策收集、使用及共享您的个人信息。本隐私权政策包含了贝壳传奇收集、存储、使用、共享和保护您的个人信息的条款，贝壳传奇希望通过本隐私权政策向您清晰地介绍贝壳传奇对您个人信息的处理方式，因此贝壳传奇建议您完整地阅读本隐私权政策，以帮助您了解维护自己隐私权的方式。如您对本隐私权政策有任何疑问，您可以通过贝壳传奇平台公布的联系方式与贝壳传奇联系。如果您不同意本隐私权政策任何内容，您应立即停止使用贝壳传奇平台服务。当您使用贝壳传奇平台提供的任一服务时，即表示您已同意贝壳传奇按照本隐私权政策来合法使用和保护您的个人信息。<br>
        一、适用范围
        &emsp;&emsp;为用户提供更好、更优、更个性化的服务是贝壳传奇坚持不懈的追求，也希望通过贝壳传奇提供的服务可以更方便您的生活。本隐私权政策适用于贝壳传奇平台提供的所有服务，您访问贝壳传奇平台网站及/或登陆相关客户端使用贝壳传奇平台提供的服务，均适用本隐私权政策。
        &emsp;&emsp;需要特别说明的是，本隐私权政策不适用于其他第三方向您提供的服务，例如贝壳传奇上的卖家依托贝壳传奇平台向您提供服务时，您向卖家提供的个人信息不适用于本隐私权政策。<br>
        二、信息收集
        &emsp;&emsp;贝壳传奇收集信息是为了向您提供更好、更优、更个性化的服务，我们收集信息的方式如下：
        &emsp;&emsp;1.您向贝壳传奇提供的信息。当您注册贝壳传奇账户及您在使用贝壳传奇平台提供的相关服务时填写及/或提交的信息，包括您的姓名、性别、出生年月日、身份证号码、电话号码、电子邮箱、地址及相关附加信息（如您所在的省份和城市、邮政编码等）。
        &emsp;&emsp;2.在您使用服务过程中收集的信息。为了提供并优化您需要的服务，贝壳传奇会收集您使用服务的相关信息，这类信息包括：
        &emsp;&emsp;在您使用贝壳传奇平台服务，或访问贝壳传奇平台网页时，贝壳传奇自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；如您下载或使用贝壳传奇或其关联公司客户端软件，或访问移动网页使用贝壳传奇平台服务时，贝壳传奇可能会读取与您位置和移动设备相关的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。
        &emsp;&emsp;除上述信息外，贝壳传奇还可能为了提供服务及改进服务质量的合理需要而收集您的其他信息，包括您与贝壳传奇的客户服务团队联系时您提供的相关信息，您参与问卷调查时向贝壳传奇发送的问卷答复信息，以及您与贝壳传奇的关联方、贝壳传奇合作伙伴之间互动时贝壳传奇收集的相关信息。与此同时，为提高您使用贝壳传奇平台提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，贝壳传奇可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断您账户的风险，并可能会记录一些贝壳传奇认为有风险的URL。<br>
        3.来自第三方的信息
        &emsp;&emsp;为了给您提供更好、更优、更加个性化的服务，或共同为您提供服务，或为了预防互联网欺诈的目的，贝壳传奇的关联方、合作伙伴会依据法律的规定或与您的约定或征得您同意的前提下，向贝壳传奇分享您的个人信息。
        &emsp;&emsp;您了解并同意，以下信息不适用本隐私权政策：
        a）您在使用贝壳传奇平台提供的搜索服务时输入的关键字信息；
        b）信用评价、违反法律规定或违反贝壳传奇规则行为及贝壳传奇已对您采取的措施；
        c ) 应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息。<br>
        三、信息使用
        &emsp;&emsp;因收集您的信息是为了向您提供服务及提升服务质量的目的，为了实现这一目的，贝壳传奇会把您的信息用于下列用途：
        1.向您提供您使用的各项服务，并维护、改进这些服务。
        2.向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或者在征得您同意的情况下与贝壳传奇的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。
        3.贝壳传奇可能使用您的个人信息以预防、发现、调查欺诈、危害安全、非法或违反与贝壳传奇或其关联方协议、政策或规则的行为，以保护您、其他贝壳传奇用户，或贝壳传奇或其关联方的合法权益。
        4.贝壳传奇可能会将来自某项服务的个人信息与来自其他服务的信息结合起来，用于为了给您提供更加个性化的服务使用，例如让您拥有更广泛的社交圈的需要而使用、共享或披露。
        5.经您许可的其他用途。<br>
        四、信息共享
        &emsp;&emsp;贝壳传奇对您的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息，贝壳传奇会在下列情况下才将您的信息与第三方共享：
        1.事先获得您的同意或授权。
        2.根据法律法规的规定或行政或司法机构的要求。
        3.向贝壳传奇的关联方分享您的个人信息。
        4.向可信赖的合作伙伴提供您的个人信息，让他们根据贝壳传奇的指示并遵循我们的隐私权政策以及其他任何相应的保密和安全措施来为贝壳传奇处理这些信息。
        5.如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷。
        6.只有共享您的信息，才能提供您需要的服务，或处理您与他人的纠纷或争议。例如您在贝壳传奇上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，贝壳传奇会视情况向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。
        7.如您出现违反中国有关法律、法规或者贝壳传奇相关协议或相关规则的情况，需要向第三方披露。
        8.为维护贝壳传奇及其关联方或用户的合法权益。<br>
        五、Cookie 和网络 Beacon 的使用
        &emsp;&emsp;为使您获得更轻松的访问体验，您访问贝壳传奇平台相关网站或使用贝壳传奇平台提供的服务时，贝壳传奇可能会通过小型数据文件识别您的身份，这么做是帮您省去重复输入注册信息的步骤，或者帮助判断您的账户安全。这些数据文件可能是Cookie，Flash Cookie，或您的浏览器或关联应用程序提供的其他本地存储(统称“Cookie”)。
        &emsp;&emsp;请您理解，贝壳传奇的某些服务只能通过使用“Cookie”才可得到实现。如果您的浏览器或浏览器附加服务允许，您可以修改对Cookie的接受程度或者拒绝贝壳传奇的Cookie，但这一举动在某些情况下可能会影响您安全访问贝壳传奇平台相关网站和使用贝壳传奇平台提供的服务。
        &emsp;&emsp;网页上常会包含一些电子图象（称为"单像素" GIF 文件或 "网络 beacon"），使用网络beacon可以帮助网站计算浏览网页的用户或访问某些cookie，贝壳传奇会通过网络beacon收集您浏览网页活动的信息，例如您访问的页面地址、您先前访问的援引页面的位址、您停留在页面的时间、您的浏览环境以及显示设定等。<br>
        六、信息存储
        &emsp;&emsp;贝壳传奇收集的有关您的信息和资料将保存在贝壳传奇及（或）其他公司的服务器上，这些信息和资料可能传送至您所在国家、地区或贝壳传奇收集信息和资料所在地并在该地被访问、存储和展示。<br>
        七、信息保护
        &emsp;&emsp;为保障您的信息安全，贝壳传奇努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。贝壳传奇对可能接触到您的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。贝壳传奇会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，贝壳传奇将尽力做到使您的信息不被泄漏、毁损或丢失。
        &emsp;&emsp;您的账户均有安全保护功能，请妥善保管您的账户及密码信息。贝壳传奇将通过向其它服务器备份、对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您理解在信息网络上不存在“完善的安全措施”。
        &emsp;&emsp;在使用贝壳传奇平台服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是你的账户及密码发生泄露，请您立即联络贝壳传奇客服，以便贝壳传奇采取相应措施。<br>
        八、未成年人保护
        &emsp;&emsp;贝壳传奇不会在知情的情况下收集未成年人的个人信息，也不建议未成年人使用贝壳传奇的服务。除非所在地法律允许并且监护人同意，未成年人请不要注册账户或发送自己的姓名、住址、电话、邮件地址等个人信息给贝壳传奇。如果贝壳传奇不小心收集到了未成年人的信息，贝壳传奇在知情后会尽快删除。如果您认为贝壳传奇可能不当地持有来自于或关于未成年人的信息，请联系贝壳传奇。
      </p>
    </div>
    <div class="d-flex justify-content-center py-3">
      <van-button @click="show" class="but" type="info">我已阅读</van-button>
    </div>
  </div>
</template>
<script>
export default {
  data () {
    return {

    }
  },
  methods: {
    show () {
      this.$emit('show')
    }
  }
}
</script>
<style lang="scss" scoped>
  @import "~@/assets/scss/js-base.scss";
  .but{
    width: 325px;
  }
</style>
